{
"Database": [
    {
        "id": "Guts",
        "title": "Guts",
        "summary": "Guts, a seasoned mercenary, drifts from one company to another, honing his combat skills through constant battles. His path intersects with Griffith, a charismatic leader whose defeat forces Guts into joining the Band of the Hawk. Renowned for his unparalleled strength and determination, Guts embodies the essence of a Byronic hero—a figure destined to challenge fate yet unable to defy it indefinitely.",
        "summary1": "Following the harrowing events of the Eclipse, where he suffers grievous injuries losing his left forearm and right eye, Guts embarks on a quest for vengeance against Griffith, now transformed into the formidable entity known as Femto. Alongside his mission for retribution, Guts also endeavors to protect his beloved Casca, who has been left mentally scarred by the horrors of the Eclipse.",
        "imgURL": "https://i.redd.it/udjnpyxjsro31.png",
        "details": "Guts, also known as the Black Swordsman, is a master warrior and raid leader endowed with supernatural abilities. He possesses superhuman speed, strength, and endurance, along with the ability to detect and combat evil spirits and demons due to the Brand of Sacrifice. With the Berserker Armor, he gains enhanced power, though its prolonged use risks his destruction. With the aid of Schierke, a skilled witch, he can better control the armor's abilities and confront the darkest threats to his world.",
        "details1": "Guts' mastery of swordsmanship transcends ordinary levels, evident in his ability to wield colossal swords with finesse and precision. His prowess shines in battles against demonic adversaries, showcasing his unmatched skill. Proficient in various bladed weapons, Guts also demonstrates expertise in complex firearms and excels as an equestrian. Despite his imposing stature, he possesses remarkable speed, agility, and dexterity, enabling him to swiftly dispatch multiple foes in combat."
    }
]
}